In [3]:
import pandas as pd
df=pd.read_csv("sample_data.csv")

In [5]:
df.head()

   ID     Name   Age  Gender   Income         City
0   1    Alice  25.0  Female  50000.0     New York
1   2      Bob  30.0    Male  60000.0  Los Angeles
2   3  Charlie  35.0    Male      NaN      Chicago
3   4    David   NaN    Male  80000.0      Houston
4   5      Eve  40.0  Female  75000.0      Phoenix

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   Name    5 non-null      object
 2   Age     4 non-null      float64
 3   Gender  5 non-null      object
 4   Income  4 non-null      float64
 5   City    5 non-null      object
dtypes: float64(2), int64(1), object(3)
memory usage: 372.0+ bytes

In [9]:
df.isnull().sum()

ID        0
Name      0
Age       1
Gender    0
Income    1
City      0
dtype: int64

In [11]:
df.dropna(axis=0)

   ID   Name   Age  Gender   Income         City
0   1  Alice  25.0  Female  50000.0     New York
1   2    Bob  30.0    Male  60000.0  Los Angeles
4   5    Eve  40.0  Female  75000.0      Phoenix

In [13]:
df.isnull().sum()

ID        0
Name      0
Age       1
Gender    0
Income    1
City      0
dtype: int64

In [18]:
df1=df.dropna(axis=0)

In [21]:
df1

   ID   Name   Age  Gender   Income         City
0   1  Alice  25.0  Female  50000.0     New York
1   2    Bob  30.0    Male  60000.0  Los Angeles
4   5    Eve  40.0  Female  75000.0      Phoenix

In [25]:
df1.isnull().sum()

ID        0
Name      0
Age       0
Gender    0
Income    0
City      0
dtype: int64

In [27]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
df=pd.read_csv("sample_data.csv")
label_encoder=LabelEncoder()
df["Gender"]=label_encoder.fit_transform(df["Gender"])
print(df.head())

   ID     Name   Age  Gender   Income         City
0   1    Alice  25.0       0  50000.0     New York
1   2      Bob  30.0       1  60000.0  Los Angeles
2   3  Charlie  35.0       1      NaN      Chicago
3   4    David   NaN       1  80000.0      Houston
4   5      Eve  40.0       0  75000.0      Phoenix

In [29]:
df["City"]=label_encoder.fit_transform(df["City"])
print(df.head())

   ID     Name   Age  Gender   Income  City
0   1    Alice  25.0       0  50000.0     3
1   2      Bob  30.0       1  60000.0     2
2   3  Charlie  35.0       1      NaN     0
3   4    David   NaN       1  80000.0     1
4   5      Eve  40.0       0  75000.0     4

In [31]:
df.dropna()

   ID   Name   Age  Gender   Income  City
0   1  Alice  25.0       0  50000.0     3
1   2    Bob  30.0       1  60000.0     2
4   5    Eve  40.0       0  75000.0     4

In [33]:
df.isnull().sum()

ID        0
Name      0
Age       1
Gender    0
Income    1
City      0
dtype: int64

In [37]:
df['Age'].fillna(df['Age'].mean(),inplace=True)
df['Income'].fillna(df['Income'].mean(),inplace=True)

C:\Users\Diyanjali\AppData\Local\Temp\ipykernel_33312\1939931343.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace=True)
C:\Users\Diyanjali\AppData\Local\Temp\ipykernel_33312\1939931343.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Income'].fillna(df['Income'].mean(),inplace=True)

In [39]:
df

   ID     Name   Age  Gender   Income  City
0   1    Alice  25.0       0  50000.0     3
1   2      Bob  30.0       1  60000.0     2
2   3  Charlie  35.0       1  66250.0     0
3   4    David  32.5       1  80000.0     1
4   5      Eve  40.0       0  75000.0     4

In [41]:
df.isnull().sum()

ID        0
Name      0
Age       0
Gender    0
Income    0
City      0
dtype: int64

In [43]:
df.drop_duplicates(inplace=True)

In [45]:
df

   ID     Name   Age  Gender   Income  City
0   1    Alice  25.0       0  50000.0     3
1   2      Bob  30.0       1  60000.0     2
2   3  Charlie  35.0       1  66250.0     0
3   4    David  32.5       1  80000.0     1
4   5      Eve  40.0       0  75000.0     4

In [47]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
df[['Age', 'Income']] = scaler.fit_transform(df[['Age', 'Income']])

In [49]:
df

   ID     Name  Age  Gender    Income  City
0   1    Alice -1.5       0 -1.523624     3
1   2      Bob -0.5       1 -0.586009     2
2   3  Charlie  0.5       1  0.000000     0
3   4    David  0.0       1  1.289220     1
4   5      Eve  1.5       0  0.820413     4